app/Controllers/Admin/AdminController.php

SELECT COUNT(*) AS `numrows`
FROM `gejala`
SELECT COUNT(*) AS `numrows`
FROM `penyakits`
SELECT COUNT(*) AS `numrows`
FROM `diagnosis_results`
SELECT COUNT(*) AS `numrows`
FROM `login`
SELECT *
FROM `diagnosis_results`
 LIMIT 5
SELECT `dr`.`penyakit_terdiagnosis`, `p`.`nama_penyakit`, COUNT(*) as cnt
FROM `diagnosis_results` `dr`
LEFT JOIN `penyakits` `p` ON `p`.`kode_penyakit` = `dr`.`penyakit_terdiagnosis`
WHERE `dr`.`penyakit_terdiagnosis` IS NOT NULL
GROUP BY `dr`.`penyakit_terdiagnosis`
ORDER BY `cnt` DESC
---
    public function index()
    {
        //

        $gejala = $this->db->table("gejala")->countAllResults();
        $penyakit = $this->db->table("penyakits")->countAllResults();
        $diagnosis = $this->db->table("diagnosis_results")->countAllResults();
        $user = $this->db->table("login")->countAllResults();
        $recentDiagnosis = $this->db->table("diagnosis_results")->limit(5)->get()->getResultArray();
        // dd($recentDiagnosis);

        // return view('admin/dashboard', compact('gejala', 'penyakit', 'diagnosis', 'user', 'recentDiagnosis'));
        // ambil frekuensi penyakit berdasarkan kode, join untuk dapat nama
        $rows = $this->db->table('diagnosis_results dr')
            ->select('dr.penyakit_terdiagnosis, p.nama_penyakit, COUNT(*) as cnt')
            ->join('penyakits p', 'p.kode_penyakit = dr.penyakit_terdiagnosis', 'left')
            ->where('dr.penyakit_terdiagnosis IS NOT NULL')
            ->groupBy('dr.penyakit_terdiagnosis')
            ->orderBy('cnt', 'DESC')
            ->get()
            ->getResultArray();

SELECT *
FROM `login`
WHERE `username` = 'admin'
 LIMIT 1
---
    public function checkLogin()
    {
        //
        $session = session();
        $user_model = new Login();
        $username = $this->request->getVar('username');
        // dd($username);
        $password = $this->request->getVar('login')['password'];

        $data = $user_model->where('username', $username)->first();

SELECT *
FROM `penyakits`
---
    public function editGejala($id)
    {
        $judul = 'Edit Gejala';
        $model = new Gejala();
        // $gejala = $model->find($id);
        $gejala = $model->getRelasiPengetahuan($id)[0];

        // dd($gejala['kode_penyakit']);
        $penyakit = new Penyakit();
        $penyakit = $penyakit->findAll();

UPDATE `gejala` SET `kode_gejala` = 'G02', `nama_gejala` = 'Umbi menjadi lunak dan berair', `updated_at` = '2025-08-31 10:27:25'
WHERE `gejala`.`kode_gejala` IN ('G02')
---
            $db->transStart();

            // 1) Update gejala berdasarkan primary key (id)
            $updateGejala = $gejala->update($id, $dataGejala);

UPDATE `basispengetahuans` SET `kode_gejala` = 'G02', `kode_penyakit` = 'P01', `mb` = 0.85, `md` = 0.05, `cf` = 0.8
WHERE `kode_gejala` = 'G02'
---
            }

            // 2) Update basis pengetahuan berdasarkan kode_gejala (atau id jika ada kolom FK)
            $bpUpdated = $basisPengetahuan
                ->where('kode_gejala', $this->request->getPost('kode_gejala'))
                ->set($dataBasisPengetahuan)
                ->update();