app/Controllers/Admin/AdminController.php

SELECT *
FROM `penyakits`
---
    public function displayPenyakit()
    {
        $judul = 'Manajemen Penyakit';
        $model = new Penyakit();
        $penyakit = $model->findAll();

UPDATE `penyakits` SET `kode_penyakit` = 'P01', `nama_penyakit` = 'Busuk Umbi', `det_penyakit` = 'Penyakit busuk umbi disebabkan oleh jamur Rhizopus stolonifer yang menyerang umbi ubi jalar. Gejala utama meliputi bercak coklat kehitaman pada umbi, tekstur umbi menjadi lunak dan berair, serta munculnya miselium jamur berwarna putih hingga abu-abu pada permukaan umbi yang terinfeksi.', `srn_penyakit` = 'Pengendalian: 1) Panen umbi pada kondisi cuaca kering, 2) Hindari luka pada umbi saat panen, 3) Simpan umbi di tempat kering dan berventilasi baik, 4) Pisahkan umbi yang terinfeksi, 5) Gunakan fungisida berbahan aktif mankozeb atau klorotalonil, 6) Rotasi tanaman dengan tanaman non-solanaceae.'
WHERE `penyakits`.`kode_penyakit` IN ('P01')
---
            $db->transStart();

            // Update penyakit berdasarkan primary key (id)
            $updatePenyakit = $penyakit->update($id, $dataPenyakit);