app/Models/Gejala.php

SELECT `g`.`kode_gejala`, `bp`.`kode_pengetahuan`, `p`.`nama_penyakit`, `g`.`nama_gejala`, `bp`.`mb`, `bp`.`md`, `bp`.`cf`, `p`.`kode_penyakit`
FROM `basispengetahuans` `bp`
JOIN `penyakits` `p` ON `bp`.`kode_penyakit` = `p`.`kode_penyakit`
JOIN `gejala` `g` ON `bp`.`kode_gejala` = `g`.`kode_gejala`
ORDER BY `p`.`nama_penyakit` ASC, `g`.`kode_gejala` ASC
SELECT `g`.`kode_gejala`, `bp`.`kode_pengetahuan`, `p`.`nama_penyakit`, `g`.`nama_gejala`, `bp`.`mb`, `bp`.`md`, `bp`.`cf`, `p`.`kode_penyakit`
FROM `basispengetahuans` `bp`
JOIN `penyakits` `p` ON `bp`.`kode_penyakit` = `p`.`kode_penyakit`
JOIN `gejala` `g` ON `bp`.`kode_gejala` = `g`.`kode_gejala`
WHERE `g`.`kode_gejala` = 'G01'
ORDER BY `p`.`nama_penyakit` ASC, `g`.`kode_gejala` ASC
---
    public function getRelasiPengetahuan($id = null)
    {
        $builder = $this->db->table('basispengetahuans bp')
            ->select('g.kode_gejala, bp.kode_pengetahuan, p.nama_penyakit, g.nama_gejala, bp.mb, bp.md, bp.cf, p.kode_penyakit')
            ->join('penyakits p', 'bp.kode_penyakit = p.kode_penyakit')
            ->join('gejala g', 'bp.kode_gejala = g.kode_gejala')
            ->orderBy('p.nama_penyakit', 'ASC')
            ->orderBy('g.kode_gejala', 'ASC');

        // Jika $id dikirim, filter berdasarkan ID
        if ($id !== null) {
            $builder->where('g.kode_gejala', $id);  // pastikan kolom ID sesuai di tabel basispengetahuans
        }

        return $builder->get()->getResultArray();