app/Models/Penyakit.php

    public function getRecommendationsArray($kodePenyakit)
    {
        $disease = $this->find($kodePenyakit);
---
SELECT *
FROM `penyakits`
WHERE `penyakits`.`kode_penyakit` = 'P01'